// 1) წინასწარ შექმენით შემდეგი ტიპის ფოლდერები:
// /Task12
//    test/
//        main.txt
//     test2/
//         main.txt
//     main.js
//      second.txt
// და ჩაწერეთ შიგნით რენდომ ტექსტი თითოეულში თქვენი მიზანია დაწეროთ ფუნცქია რომელიც წაიკითხავს რეკურსიულად ყველა .txt გაფარტოების ფაილს და დაგილოგავთ სულ რამდენი სიტყვაა ყველა ფაილში ერთად, პლუს რამდენი, ხმოვანი.

// 2) შექმენით სერვერი რომელიც უპასუხებს შემდეგი ტიპის რექუესთებს:
// GET  /about დააბრუნეთ რაიმე ტიპის ინფორმაცია მაგალითად, სახელი, გვარი, ჰობი და ა.შ

// GET /players უნდა დააბრუნოს მაისივი ფეხბურთელების რომელსაც წაიკითხავთ players.json დან fs მოდულით

// GET /players?nation=georgia უდნა დააბრუნოს მხოლოდ ქართველი ფეხბურთელები

// GET /players?nation=germany მხოლოდ გერმანელი ფეხბურტელები და ა.შ

// POST /players უნდა გაატანოთ ფეხბურთელის ყველა მონაცემები ბექენდში დაადოთ ვალიდაცია და ჩაწეროთ players.json ში.

// DELETE /players/1 წაშლის კონკრეტულ ფეღბურთელს და განაახლებს players.json-ს
