// მოგესალმებით თქვენი დავალება შემდეგია.
// 1) შექმენით ნესტის აპლიკაცია და დაამატეთ ორი ახალი მოდული.
// 2) უნდა გქონდეთ იუზერების მოდული სადაც გექნებატ CRUD ტიპის ოპერაციები, თითოეულ იუზერს უნდა ქონდეს შემდგი ტიპის ფროპერთიები:
// id-ეს სისტემამ უნდა მიანიჭოს ავტომატურად როგორც შვებით ხოლმე. firstName, lastName, email, phoneNumber, gender.
// 3) უნდა გქონდეთ იქსფენსების მოდული სადაც გააკეთებთ ქრადის ტიპის ოპერაციებს. თითეულ იქსფენსს უნდა ქონდეს შემდეგი ტიპის ფროფერთიები:
// id-ეს სისტემამ უნდა მიანიჭოს ავტომატურად როგორც შვებით ხოლმე. category, productName, quantity, price, totalPrice-ეს ავტომატურად უნდა გამოითვალოს რაოდენობის და ფასის ხარჯზე.
// ორივე ინფორმაცია შეინახეთ ცვლადებში როგორც ლექციაზე ვქენით
